In [3]:
import pandas as pd
df=pd.DataFrame({'col1':['a','b','c','d'],'col2':[10,20,30,40],'col3':[1,2,3,4]})
df.head()

  col1  col2  col3
0    a    10     1
1    b    20     2
2    c    30     3
3    d    40     4

## Handy DataFrame Operations

In [4]:
df.shape

(4, 3)

In [5]:
df

  col1  col2  col3
0    a    10     1
1    b    20     2
2    c    30     3
3    d    40     4

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
 2   col3    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [7]:
df.describe()

            col2      col3
count   4.000000  4.000000
mean   25.000000  2.500000
std    12.909944  1.290994
min    10.000000  1.000000
25%    17.500000  1.750000
50%    25.000000  2.500000
75%    32.500000  3.250000
max    40.000000  4.000000

In [8]:
df['col3'].unique()

array([1, 2, 3, 4], dtype=int64)

In [9]:
df['col3'].value_counts()

4    1
3    1
2    1
1    1
Name: col3, dtype: int64

In [12]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [13]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Sorting

In [15]:
df.sort_values(by='col3')

  col1  col2  col3
0    a    10     1
1    b    20     2
2    c    30     3
3    d    40     4

In [16]:
df.sort_values(by='col3',ascending=False)

  col1  col2  col3
3    d    40     4
2    c    30     3
1    b    20     2
0    a    10     1

## Apply

In [17]:
def add(x):
    return x+2

In [18]:
df['col2'].apply(lambda x:x+2)

0    12
1    22
2    32
3    42
Name: col2, dtype: int64

In [19]:
df['col2']

0    10
1    20
2    30
3    40
Name: col2, dtype: int64

In [20]:
df['col2'].sum()

100

In [21]:
df['col2'].apply('sum')

100

In [22]:
df['col2'].apply('mean')

25.0

In [24]:
def rename(x):
    return x+'.?'
df['col1'].apply(rename)

0    a.?
1    b.?
2    c.?
3    d.?
Name: col1, dtype: object

In [29]:
df2=pd.DataFrame({'lat':["22*35","25*55"],'long':["82*34","53*33"]})
df2

     lat   long
0  22*35  82*34
1  25*55  53*33

In [31]:
def deg(x):
    degree=float(x.split('*')[0])
    minute=float(x.split('*')[1][:-1])
    total=degree+(minute/60)
    return total

In [32]:
df2['lat'].apply(deg)

0    22.050000
1    25.083333
Name: lat, dtype: float64

In [33]:
df2['long'].apply(deg)

0    82.05
1    53.05
Name: long, dtype: float64

## Missing values

In [34]:
import numpy as np

In [36]:
df=pd.DataFrame({'a':[1,np.nan,3,10],'b':[np.nan,np.nan,6,11],'c':[7,8,np.nan,12]})

In [37]:
df

      a     b     c
0   1.0   NaN   7.0
1   NaN   NaN   8.0
2   3.0   6.0   NaN
3  10.0  11.0  12.0

In [40]:
a=r"a\nb"

In [41]:
a

'a\\nb'

In [42]:
print(a)

a\nb

In [43]:
df.isnull()

       a      b      c
0  False   True  False
1   True   True  False
2  False  False   True
3  False  False  False

In [44]:
df.isnull().sum()

a    1
b    2
c    1
dtype: int64

In [45]:
df.isnull().sum(axis=1)

0    1
1    2
2    1
3    0
dtype: int64

In [46]:
#dropna-any kind of null values it will drop

In [47]:
df.dropna()

      a     b     c
3  10.0  11.0  12.0

In [48]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [49]:
df.dropna(thresh=2)

      a     b     c
0   1.0   NaN   7.0
2   3.0   6.0   NaN
3  10.0  11.0  12.0

In [50]:
df

      a     b     c
0   1.0   NaN   7.0
1   NaN   NaN   8.0
2   3.0   6.0   NaN
3  10.0  11.0  12.0